// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Содержимое записи.
// 
// Параметры:
//  КлючЗаписиРегистра - См. РегистрыСведений.ИТМ_ИсторияФормированияОтчетов.СодержимоеЗаписи.КлючЗаписиРегистра
// 
// Возвращаемое значение:
//  см. ИТМ_ИсторияФормированияОтчетовКлиентСервер.ШаблонЗаписиИсторииФормированияОтчетов
Функция СодержимоеЗаписи(КлючЗаписиРегистра) Экспорт
	
	Возврат РегистрыСведений.ИТМ_ИсторияФормированияОтчетов.СодержимоеЗаписи(КлючЗаписиРегистра);
		
КонецФункции

// см. ИТМ_ИсторияФормированияОтчетов.ДобавитьЗаписьВЖурналРегистрации
Процедура ДобавитьЗаписьВЖурналРегистрации(Параметры, 
	ПодИмяСобытия, Комментарий, ЭтоОшибка = Истина, Сообщать = Истина) Экспорт
	
	ИТМ_ИсторияФормированияОтчетов.ДобавитьЗаписьВЖурналРегистрации(
		Параметры, ПодИмяСобытия, Комментарий, ЭтоОшибка, Сообщать);
		
КонецПроцедуры

// см. ИТМ_ИсторияФормированияОтчетов.ИспользоватьИсториюФормированияОтчетов
Функция ИспользоватьИсториюФормированияОтчетов() Экспорт
	
	Возврат ИТМ_ИсторияФормированияОтчетов.ИспользоватьИсториюФормированияОтчетов();
	
КонецФункции

// см. ИТМ_ИсторияФормированияОтчетов.ЗагрузитьЗаписиВРегистрИзТекстаФайла
Процедура ЗагрузитьЗаписиВРегистрИзТекстаФайла(ТекстФайла) Экспорт
	
	ИТМ_ИсторияФормированияОтчетов.ЗагрузитьЗаписиВРегистрИзТекстаФайла(ТекстФайла);
	
КонецПроцедуры

// см. ИТМ_ИсторияФормированияОтчетов.ДанныеЗаписейРегистраДляСохраненияВФайл
Функция ДанныеЗаписейРегистраДляСохраненияВФайл(ЗаписиРегистра) Экспорт
	
	Возврат ИТМ_ИсторияФормированияОтчетов.ДанныеЗаписейРегистраДляСохраненияВФайл(ЗаписиРегистра);
	
КонецФункции

// см. ИТМ_ИсторияФормированияОтчетовКлиентСервер.ЗначениеВСтрокуJSON
Функция ЗначениеВСтрокуJSON(Значение) Экспорт
	
	Возврат ИТМ_ИсторияФормированияОтчетовКлиентСервер.ЗначениеВСтрокуJSON(Значение);

КонецФункции

// см. ИТМ_ИсторияФормированияОтчетовКлиентСервер.ЗначениеИзСтрокиJSON
Функция ЗначениеИзСтрокиJSON(СтрокаJSON, ПрочитатьВСоответствие = Ложь) Экспорт
    
    Возврат ИТМ_ИсторияФормированияОтчетовКлиентСервер.ЗначениеИзСтрокиJSON(СтрокаJSON, ПрочитатьВСоответствие);
	
КонецФункции

// см. ИТМ_ИсторияФормированияОтчетовКлиентСервер.ЗначениеВСтрокуXML
Функция ЗначениеВСтрокуXML(Значение) Экспорт
    
    Возврат ИТМ_ИсторияФормированияОтчетовКлиентСервер.ЗначениеВСтрокуXML(Значение);
    
КонецФункции

// см. ИТМ_ИсторияФормированияОтчетовКлиентСервер.ЗначениеИзСтрокиXML
Функция ЗначениеИзСтрокиXML(СтрокаXML) Экспорт
	
	Возврат ИТМ_ИсторияФормированияОтчетовКлиентСервер.ЗначениеИзСтрокиXML(СтрокаXML);
	
КонецФункции

#КонецОбласти
