// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИТМ_ИсторияФормированияОтчетов.ФормаСписка_ПриСозданииНаСервере(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработка оповещения.
// 
// Параметры:
//  ИмяСобытия - Строка
//  Параметр - Произвольный
//  Источник - Произвольный
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ИТМ_ИсторияФормированияОтчетовКлиент.ФормаСписка_ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

// Список выбор.
// 
// Параметры:
//  Элемент - ТаблицаФормы
//  ВыбраннаяСтрока - Число
//  Поле - ПолеФормы
//  СтандартнаяОбработка - Булево
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьСтроку();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда_Выбрать(Команда)
	
	ВыбратьСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_ТолькоТекущегоПользователя(Команда)
	
	КнопкаТолькоСвои();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_ВыгрузитьВФайл(Команда)
	
	ИТМ_ИсторияФормированияОтчетовКлиент.ВыгрузитьЗаписиРегистраВФайл(Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_ЗагрузитьИзФайла(Команда)
	
	ИТМ_ИсторияФормированияОтчетовКлиент.ВыбратьФайлЗагрузкиЗаписейРегистра();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура КнопкаТолькоСвои()
	
	ИТМ_ИсторияФормированияОтчетов.ФормаСписка_КнопкаТолькоСвои_ПриНажатии(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСтроку()
	
	КлючЗаписи = Элементы.Список.ТекущаяСтрока; //РегистрСведенийКлючЗаписи.ИТМ_ИсторияФормированияОтчетов
	
	ИТМ_ИсторияФормированияОтчетовКлиентСервер.ПрименитьВсеНастройкиЗавершение(ВладелецФормы, КлючЗаписи);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
