// @strict-types
// sonar:off

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается перед подготовкой параметров истории формирования и их помещения в переменную "Параметры"
//
// Параметры:
//   Параметры				- См. ВариантыОтчетов.СформироватьОтчет.Параметры
//   СтандартнаяОбработка	- Булево - Если Ложь, то стандартная обработка выполняться не будет.
// 
Процедура ПередПодготовкойВыполнениемОтчета(Параметры, СтандартнаяОбработка) Экспорт
	
	//
	
КонецПроцедуры

// см. ИТМ_ИсторияФормированияОтчетов.ВариантыОтчетов_СформироватьОтчет_ПередВыполнением
Процедура ПослеПодготовкиВыполненияОтчета(Параметры) Экспорт
	
	//
		
КонецПроцедуры

// Вызывается перерд основным алгоритмом подсистемы (после формирования отчета)
//
// Параметры:
//   Параметры - см. ИТМ_ИсторияФормированияОтчетовКлиентСервер.ШаблонПараметровФормированияОтчета
//   Результат - см. ИТМ_ИсторияФормированияОтчетовКлиентСервер.ШаблонРезультатВыполненияОтчета
//   СтандартнаяОбработка	- Булево - Если Ложь, то стандартная обработка выполняться не будет.
// 
Процедура ПередВыполнениемАлгоритмаПослеФормированияОтчета(Параметры, Результат, СтандартнаяОбработка) Экспорт
	
	//
		
КонецПроцедуры

// Вызывается перед заполнением структуры с данными, которые будут записаны в регистр истории.
//
// Параметры:
//   Параметры				- см. ИТМ_ИсторияФормированияОтчетовКлиентСервер.ШаблонПараметровФормированияОтчета
//   Результат				- см. ИТМ_ИсторияФормированияОтчетовКлиентСервер.ШаблонРезультатВыполненияОтчета
//   ДанныеДляИстории		- см. ИТМ_ИсторияФормированияОтчетовКлиентСервер.ШаблонЗаписиИсторииФормированияОтчетов
//   СтандартнаяОбработка	- Булево - Если Ложь, то стандартная обработка выполняться не будет.
//
Процедура ПередЗаполнениемДанныхДляИстории(Параметры, Результат, ДанныеДляИстории, СтандартнаяОбработка) Экспорт
	
	//
		
КонецПроцедуры

// Вызывается после заполнения структуры с данными, которые будут записаны в регистр истории.
//
// Параметры:
//   Параметры				- см. ИТМ_ИсторияФормированияОтчетовКлиентСервер.ШаблонПараметровФормированияОтчета
//   Результат				- см. ИТМ_ИсторияФормированияОтчетовКлиентСервер.ШаблонРезультатВыполненияОтчета
//   ДанныеДляИстории		- см. ИТМ_ИсторияФормированияОтчетовКлиентСервер.ШаблонЗаписиИсторииФормированияОтчетов
//
Процедура ПослеЗаполненияДанныхДляИстории(Параметры, Результат, ДанныеДляИстории) Экспорт
	
	//
		
КонецПроцедуры

// Запускается перед проверкой необходимости записи в историю формирования
//
// Параметры:
//   Параметры            - см. ИТМ_ИсторияФормированияОтчетовКлиентСервер.ШаблонПараметровФормированияОтчета
//   Результат            - см. ИТМ_ИсторияФормированияОтчетовКлиентСервер.ШаблонРезультатВыполненияОтчета
//   ДанныеДляИстории     - см. ИТМ_ИсторияФормированияОтчетовКлиентСервер.ШаблонЗаписиИсторииФормированияОтчетов
//   СтандартнаяОбработка - Булево - если установить Ложь, то стандартная обработка выполняться не будет.
//   Отказ                - Булево - если Истина, то писаться в историю не будет
//
Процедура ПередОпределениемНеобходимостиЗаписиВРегистрИстории(
	Параметры, Результат, ДанныеДляИстории, СтандартнаяОбработка, Отказ) Экспорт
	
	//
		
КонецПроцедуры


// Запускается перед непосредственной записью в историю формирования
//
// Параметры:
//   Параметры            - см. ИТМ_ИсторияФормированияОтчетовКлиентСервер.ШаблонПараметровФормированияОтчета
//   Результат            - см. ИТМ_ИсторияФормированияОтчетовКлиентСервер.ШаблонРезультатВыполненияОтчета
//   ДанныеДляИстории     - см. ИТМ_ИсторияФормированияОтчетовКлиентСервер.ШаблонЗаписиИсторииФормированияОтчетов
//   СтандартнаяОбработка			- Булево - если установить Ложь, то стандартная обработка выполняться не будет.
//
Процедура ПередЗаписьюВРегистрИстории(Параметры, Результат, ДанныеДляИстории, СтандартнаяОбработка) Экспорт
	
	//
		
КонецПроцедуры

// Метод вызывается перед определением командной панели на форме отчета
//
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - Форма отчета
//  ВозможныеКомандныеПанели  - Массив из Строка - коллекция с именами командных панелей, которые возможно есть на форме
//  КоманднаяПанель  - Неопределено - группа формы, на которую нужно помещать кнопки подсистемы
//
Процедура ПередОпределениемКоманднойПанелиОтчета(Форма, ВозможныеКомандныеПанели, КоманднаяПанель) Экспорт
	                       
	//Можно добавить возможную командную панель
	//ВозможныеКомандныеПанели.Добавить("КоманднаяПанельНашейПодсистемы");
	
	//Можно указать напрямую командную панель
	//КоманднаяПанель = Форма.Элементы.МояКоманднаяПанель
	
КонецПроцедуры

#КонецОбласти
