
// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ИТМ_ИсторияФормированияОтчетов.ЕстьПравоПросмотрСвоейИстории() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда_ОткрытьОтчет(Команда)
	
	ИТМ_ИсторияФормированияОтчетовКлиент.ОткрытьОтчетПоЗаписиРегистра(
		ЭтотОбъект, Запись.ИсходныйКлючЗаписи);
	
КонецПроцедуры

#КонецОбласти
